{
	"format": "layers-model",
	"generatedBy": "keras v2.10.0",
	"convertedBy": "TensorFlow.js Converter v3.19.0",
	"modelTopology": {
		"keras_version": "2.10.0",
		"backend": "tensorflow",
		"model_config": {
			"class_name": "Sequential",
			"config": {
				"name": "sequential_3",
				"layers": [
					{
						"class_name": "InputLayer",
						"config": {
							"batch_input_shape": [null, 30, 1662],
							"dtype": "float32",
							"sparse": false,
							"ragged": false,
							"name": "lstm_9_input"
						}
					},
					{
						"class_name": "LSTM",
						"config": {
							"name": "lstm_9",
							"trainable": true,
							"batch_input_shape": [null, 30, 1662],
							"dtype": "float32",
							"return_sequences": true,
							"return_state": false,
							"go_backwards": false,
							"stateful": false,
							"unroll": false,
							"time_major": false,
							"units": 64,
							"activation": "relu",
							"recurrent_activation": "sigmoid",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "GlorotUniform",
								"config": { "seed": null }
							},
							"recurrent_initializer": {
								"class_name": "Orthogonal",
								"config": { "gain": 1.0, "seed": null }
							},
							"bias_initializer": { "class_name": "Zeros", "config": {} },
							"unit_forget_bias": true,
							"kernel_regularizer": null,
							"recurrent_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"recurrent_constraint": null,
							"bias_constraint": null,
							"dropout": 0.0,
							"recurrent_dropout": 0.0,
							"implementation": 2
						}
					},
					{
						"class_name": "LSTM",
						"config": {
							"name": "lstm_10",
							"trainable": true,
							"dtype": "float32",
							"return_sequences": true,
							"return_state": false,
							"go_backwards": false,
							"stateful": false,
							"unroll": false,
							"time_major": false,
							"units": 128,
							"activation": "relu",
							"recurrent_activation": "sigmoid",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "GlorotUniform",
								"config": { "seed": null }
							},
							"recurrent_initializer": {
								"class_name": "Orthogonal",
								"config": { "gain": 1.0, "seed": null }
							},
							"bias_initializer": { "class_name": "Zeros", "config": {} },
							"unit_forget_bias": true,
							"kernel_regularizer": null,
							"recurrent_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"recurrent_constraint": null,
							"bias_constraint": null,
							"dropout": 0.0,
							"recurrent_dropout": 0.0,
							"implementation": 2
						}
					},
					{
						"class_name": "LSTM",
						"config": {
							"name": "lstm_11",
							"trainable": true,
							"dtype": "float32",
							"return_sequences": false,
							"return_state": false,
							"go_backwards": false,
							"stateful": false,
							"unroll": false,
							"time_major": false,
							"units": 64,
							"activation": "relu",
							"recurrent_activation": "sigmoid",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "GlorotUniform",
								"config": { "seed": null }
							},
							"recurrent_initializer": {
								"class_name": "Orthogonal",
								"config": { "gain": 1.0, "seed": null }
							},
							"bias_initializer": { "class_name": "Zeros", "config": {} },
							"unit_forget_bias": true,
							"kernel_regularizer": null,
							"recurrent_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"recurrent_constraint": null,
							"bias_constraint": null,
							"dropout": 0.0,
							"recurrent_dropout": 0.0,
							"implementation": 2
						}
					},
					{
						"class_name": "Dense",
						"config": {
							"name": "dense_9",
							"trainable": true,
							"dtype": "float32",
							"units": 64,
							"activation": "relu",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "GlorotUniform",
								"config": { "seed": null }
							},
							"bias_initializer": { "class_name": "Zeros", "config": {} },
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						}
					},
					{
						"class_name": "Dense",
						"config": {
							"name": "dense_10",
							"trainable": true,
							"dtype": "float32",
							"units": 32,
							"activation": "relu",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "GlorotUniform",
								"config": { "seed": null }
							},
							"bias_initializer": { "class_name": "Zeros", "config": {} },
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						}
					},
					{
						"class_name": "Dense",
						"config": {
							"name": "dense_11",
							"trainable": true,
							"dtype": "float32",
							"units": 3,
							"activation": "softmax",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "GlorotUniform",
								"config": { "seed": null }
							},
							"bias_initializer": { "class_name": "Zeros", "config": {} },
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						}
					}
				]
			}
		},
		"training_config": {
			"loss": "categorical_crossentropy",
			"metrics": [
				[
					{
						"class_name": "MeanMetricWrapper",
						"config": {
							"name": "categorical_accuracy",
							"dtype": "float32",
							"fn": "categorical_accuracy"
						}
					}
				]
			],
			"weighted_metrics": null,
			"loss_weights": null,
			"optimizer_config": {
				"class_name": "Adam",
				"config": {
					"name": "Adam",
					"learning_rate": 0.0010000000474974513,
					"decay": 0.0,
					"beta_1": 0.8999999761581421,
					"beta_2": 0.9990000128746033,
					"epsilon": 1e-7,
					"amsgrad": false
				}
			}
		}
	},
	"weightsManifest": [
		{
			"paths": ["group1-shard1of1.bin"],
			"weights": [
				{ "name": "dense_10/kernel", "shape": [64, 32], "dtype": "float32" },
				{ "name": "dense_10/bias", "shape": [32], "dtype": "float32" },
				{ "name": "dense_11/kernel", "shape": [32, 3], "dtype": "float32" },
				{ "name": "dense_11/bias", "shape": [3], "dtype": "float32" },
				{ "name": "dense_9/kernel", "shape": [64, 64], "dtype": "float32" },
				{ "name": "dense_9/bias", "shape": [64], "dtype": "float32" },
				{
					"name": "lstm_10/lstm_cell_10/kernel",
					"shape": [64, 512],
					"dtype": "float32"
				},
				{
					"name": "lstm_10/lstm_cell_10/recurrent_kernel",
					"shape": [128, 512],
					"dtype": "float32"
				},
				{
					"name": "lstm_10/lstm_cell_10/bias",
					"shape": [512],
					"dtype": "float32"
				},
				{
					"name": "lstm_11/lstm_cell_11/kernel",
					"shape": [128, 256],
					"dtype": "float32"
				},
				{
					"name": "lstm_11/lstm_cell_11/recurrent_kernel",
					"shape": [64, 256],
					"dtype": "float32"
				},
				{
					"name": "lstm_11/lstm_cell_11/bias",
					"shape": [256],
					"dtype": "float32"
				},
				{
					"name": "lstm_9/lstm_cell_9/kernel",
					"shape": [1662, 256],
					"dtype": "float32"
				},
				{
					"name": "lstm_9/lstm_cell_9/recurrent_kernel",
					"shape": [64, 256],
					"dtype": "float32"
				},
				{
					"name": "lstm_9/lstm_cell_9/bias",
					"shape": [256],
					"dtype": "float32"
				}
			]
		}
	]
}
